# VerificationText Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TaskDialog..::..VerificationText Property
TaskDialog Class See Also
---
VerificationText is used to label the verification checkbox.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string VerificationText { get; set; }
```

Visual Basic
---
```text
Public Property VerificationText As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ VerificationText {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
Thrown if the TaskDialog has already enabled the Do not show message as the two cannot coincide in the same TaskDialog. If VerificationText is set, a checkbox with the text will be shown. You can get the response of checkbox by checking the return value of the WasVerificationChecked() method.
# See Also
TaskDialog Class
Autodesk.Revit.UI Namespace